#include <stdio.h>

void main()
{
    int year,month,days;
    int a[2][13]={{31,28,31,30,31,30,31,31,30,31,30,31},
                      {31,29,31,30,31,30,31,31,30,31,30,31}};
    int i,count=0;
    printf("请输入日期（年，月，日）");
    scanf("%d,%d,%d",&year,&month,&days);
    if(year%4==0&&year%100!=0||year%400==0)
    {
        for(i=0;i<month-1;i++)
        {
            count+=a[1][i];
        }
    }
    else
    {
        for(i=0;i<month-1;i++)
        {
            count+=a[0][i];
        }
    }
    printf("\n%d月%d日是%d年的第%d天。",month,days,year,count+days);
}
/*定义一个结构体变量（包括年、月、日）。计算该日在本年中是第几天？注意闰年问题。
输出格式要求："\n%d月%d日是%d年的第%d天。"
程序的运行示例如下：
请输入日期（年，月，日）
1990,2,14

2月14日是1990年的第45天。*/
//[2][12]={{31,28,31,30,31,30,31,31,30,31,30,31},{31,29,31,30,31,30,31,31,30,31,30,31}};
